; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BlocksDom)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BlocksProb)
(:domain BlocksDom)
(:requirements :quantified-preconditions)

(:objects A B C)
(:INIT (CLEAR C) (ONTABLE A) (ON C B) (ON B A) (HANDEMPTY))
(:goal (forall (?block) (ONTABLE ?block)))
)

; plan
1. (unstack c b)
   deleted: (clear c) (handempty) (on c b)
   added: (holding c) (clear b)
   goals met: 0 of 1
2. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 0 of 1
3. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 0 of 1
4. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 1 of 1
